Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesDeleted Property
 Some slab shape edit vertices were deleted because the Floor or Roof or Toposolid has changed its shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeWarnVerticesDeleted { get; }
Public Shared ReadOnly Property SlabShapeWarnVerticesDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeWarnVerticesDeleted {
	FailureDefinitionId^ get ();
}
static member SlabShapeWarnVerticesDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace